In [6]:
import pandas as pd
import io
import re

In [7]:
# set show full width pandas dataframe

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('display.max_colwidth', None)

In [8]:
# Set file paths input and output

file_input = './datos_data_engineer.tsv'
file_output = './datos_data_engineer.csv'

In [9]:
# get all lines from file_input

lines = (line for line in io.open(file_input, mode="r"))

In [10]:
# get lines without white space and split by tab for iterate

lines_values = (line.rstrip().split('\t') for line in lines)

In [11]:
# set a dictionary to use in pandas dataframe

dic = {'id': [], 'first_name': [], 'last_name': [], 'account_number': [], 'email': []}

# Iterate over all lines_values
# If line's length is equal to 5, do some transformation in values, keep only numbers for id and account_number
# keep only letters for first_name and last_name, and keep only letters or @ or . in email

# If line is broke, like two lines for one register, we need work inside else statement

for line in lines_values:
    if(len(line) == 5):
        id, first_name, last_name, account_number, email = line
        dic['id'].append(re.sub('[^0-9]', '', id))
        dic['first_name'].append(re.sub('[^\w]', '', first_name))
        dic['last_name'].append(re.sub('[^\w]', '', last_name))
        dic['account_number'].append(re.sub('[^0-9]', '', account_number))
        dic['email'].append((re.sub('[^\w?(@)?(.)]', '', email)).lower())
    else:
        pass

In [12]:
# Create a pandas dataframe with our dictionary
df = pd.DataFrame(data=dic)
df.head()

  id  first_name  last_name account_number                           email
0     first_name  last_name                                          email
1  1     Addison      Marks         196296            ornare.lectus@et.edu
2  2      Dakota      Garza         409025  scelerisque@praesentluctus.edu
3  3       Basia      Wolfe         637720    aliquam@nullaintegerurna.com
4  4    Germaine   Campbell         826846     id.magna@viverramaecenas.ca

In [13]:
# Remove first line, because we already have our header
df_final = df.iloc[1:]

In [14]:
# set column id as index
df_final.set_index('id')
df_final.head()

  id first_name   last_name account_number                           email
1  1    Addison       Marks         196296            ornare.lectus@et.edu
2  2     Dakota       Garza         409025  scelerisque@praesentluctus.edu
3  3      Basia       Wolfe         637720    aliquam@nullaintegerurna.com
4  4   Germaine    Campbell         826846     id.magna@viverramaecenas.ca
5  5     Lenore  Pennington         345284             aliquam@integer.edu

In [15]:
# look our shape dataframe

df_final.shape

(994, 5)

In [16]:
# export to csv file, without index name lines

df_final.to_csv(file_output,index=False)

In [17]:
# import our csv into another dataframe, for test

dataframe = pd.read_csv(file_output)
dataframe.head()

   id first_name   last_name  account_number                           email
0   1    Addison       Marks          196296            ornare.lectus@et.edu
1   2     Dakota       Garza          409025  scelerisque@praesentluctus.edu
2   3      Basia       Wolfe          637720    aliquam@nullaintegerurna.com
3   4   Germaine    Campbell          826846     id.magna@viverramaecenas.ca
4   5     Lenore  Pennington          345284             aliquam@integer.edu

In [18]:
# check shape if is equal

dataframe.shape

(994, 5)